Ran Plan for dir: `deployment/service/ols-svc-genai2` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running "/usr/bin/terraform plan -input=false -refresh -out \"/home/atlantis/.atlantis/repos/blastcoid/ols_iac/2/default/deployment/service/ols-svc-genai2/default.tfplan\"" in "/home/atlantis/.atlantis/repos/blastcoid/ols_iac/2/default/deployment/service/ols-svc-genai2": exit status 1
data.terraform_remote_state.kms_cryptokey: Reading...
module.argocd_app.data.terraform_remote_state.dns_blast: Reading...
data.terraform_remote_state.kms_cryptokey: Read complete after 1s
module.argocd_app.data.terraform_remote_state.dns_blast: Read complete after 1s
data.google_kms_secret.secrets["docker_password"]: Reading...
data.google_secret_manager_secret_version.ssh_key: Reading...
data.google_kms_secret.secrets["docker_username"]: Reading...
data.google_kms_secret.secrets["docker_password"]: Read complete after 0s [id=projects/ols-platform-dev/locations/global/keyRings/ols-dev-security-kms-keyring/cryptoKeys/ols-dev-security-kms-cryptokey:CiQAyKnBRwF8Q2h8ujLXzsvY76oEVcHLae97K3cDR06566QAPXUSMgCfAnYWA8hibTWs+qq85WYNz8GVDz4YS1BHt29SG86ULxwVyOCsAlhmgNjIL41ngjEi]
data.google_kms_secret.secrets["docker_username"]: Read complete after 0s [id=projects/ols-platform-dev/locations/global/keyRings/ols-dev-security-kms-keyring/cryptoKeys/ols-dev-security-kms-cryptokey:CiQAyKnBR7+P3pkXtpi11XDmQcmho0J4gtUJx8amJdMjFBiLUPkSMwCfAnYWtbnTYYOt+fkQc3hGoBr/N0xLkzSSd4qzeaANVpXz9VJbTxg33NvP4Z9uzWem5w==]
data.google_secret_manager_secret_version.ssh_key: Read complete after 1s [id=projects/687148684055/secrets/ssh-key-main/versions/1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.artifact_repository.google_artifact_registry_repository.repository will be created
  + resource "google_artifact_registry_repository" "repository" {
      + cleanup_policy_dry_run = false
      + create_time            = (known after apply)
      + description            = "This is the repository for ols-dev-svc-genai2 service"
      + format                 = "DOCKER"
      + id                     = (known after apply)
      + location               = "asia-southeast2"
      + mode                   = "STANDARD_REPOSITORY"
      + name                   = (known after apply)
      + project                = (known after apply)
      + repository_id          = "ols-dev-svc-genai2"
      + update_time            = (known after apply)

      + cleanup_policies {
          + action = "DELETE"
          + id     = "delete-prerelease"

          + condition {
              + older_than            = "2592000s"
              + package_name_prefixes = []
              + tag_prefixes          = []
              + tag_state             = "TAGGED"
              + version_name_prefixes = []
            }
        }
      + cleanup_policies {
          + action = "KEEP"
          + id     = "keep-tagged-release"

          + condition {
              + package_name_prefixes = [
                  + "ols-dev-svc-genai2",
                ]
              + tag_prefixes          = [
                  + "release",
                ]
              + tag_state             = "TAGGED"
              + version_name_prefixes = []
            }
        }
      + cleanup_policies {
          + action = "KEEP"
          + id     = "keep-minimum-versions"

          + most_recent_versions {
              + keep_count            = 5
              + package_name_prefixes = [
                  + "ols-dev-svc-genai2",
                ]
            }
        }
    }

  # module.github_repository.github_actions_environment_secret.test_secret["GIT_SSH_PRIVATE_KEY"] will be created
  + resource "github_actions_environment_secret" "test_secret" {
      + created_at      = (known after apply)
      + environment     = "ols_svc_genai2_dev"
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "ols_svc_genai2"
      + secret_name     = "GIT_SSH_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # module.github_repository.github_actions_environment_secret.test_secret["docker_password"] will be created
  + resource "github_actions_environment_secret" "test_secret" {
      + created_at      = (known after apply)
      + environment     = "ols_svc_genai2_dev"
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "ols_svc_genai2"
      + secret_name     = "docker_password"
      + updated_at      = (known after apply)
    }

  # module.github_repository.github_actions_environment_secret.test_secret["docker_username"] will be created
  + resource "github_actions_environment_secret" "test_secret" {
      + created_at      = (known after apply)
      + environment     = "ols_svc_genai2_dev"
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "ols_svc_genai2"
      + secret_name     = "docker_username"
      + updated_at      = (known after apply)
    }

  # module.github_repository.github_branch.dev[0] will be created
  + resource "github_branch" "dev" {
      + branch        = "dev"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "ols_svc_genai2"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # module.github_repository.github_repository.repository[0] will be created
  + resource "github_repository" "repository" {
      + allow_auto_merge                        = false
      + allow_merge_commit                      = true
      + allow_rebase_merge                      = true
      + allow_squash_merge                      = true
      + allow_update_branch                     = false
      + archive_on_destroy                      = false
      + archived                                = false
      + auto_init                               = true
      + default_branch                          = (known after apply)
      + delete_branch_on_merge                  = false
      + description                             = "This is the repository for ols_genai2"
      + etag                                    = (known after apply)
      + full_name                               = (known after apply)
      + git_clone_url                           = (known after apply)
      + has_discussions                         = true
      + has_downloads                           = false
      + has_issues                              = true
      + has_projects                            = true
      + has_wiki                                = true
      + homepage_url                            = "false"
      + html_url                                = (known after apply)
      + http_clone_url                          = (known after apply)
      + id                                      = (known after apply)
      + ignore_vulnerability_alerts_during_read = false
      + is_template                             = false
      + license_template                        = "apache-2.0"
      + merge_commit_message                    = "PR_TITLE"
      + merge_commit_title                      = "MERGE_MESSAGE"
      + name                                    = "ols_svc_genai2"
      + node_id                                 = (known after apply)
      + primary_language                        = (known after apply)
      + private                                 = (known after apply)
      + repo_id                                 = (known after apply)
      + squash_merge_commit_message             = "COMMIT_MESSAGES"
      + squash_merge_commit_title               = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url                           = (known after apply)
      + svn_url                                 = (known after apply)
      + topics                                  = [
          + "argocd",
          + "docker",
          + "fastapi",
          + "gcp",
          + "kubernetes",
          + "openai",
          + "python",
          + "service",
        ]
      + visibility                              = "public"
      + vulnerability_alerts                    = true

      + security_and_analysis {
          + secret_scanning {
              + status = "enabled"
            }
          + secret_scanning_push_protection {
              + status = "enabled"
            }
        }
    }

  # module.github_repository.github_repository_environment.environment[0] will be created
  + resource "github_repository_environment" "environment" {
      + environment = "ols_svc_genai2_dev"
      + id          = (known after apply)
      + repository  = "ols_svc_genai2"
    }

  # module.github_repository.github_team_repository.team_repo["devops"] will be created
  + resource "github_team_repository" "team_repo" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "triage"
      + repository = "ols_svc_genai2"
      + team_id    = "devops"
    }

  # module.github_repository.github_team_repository.team_repo["technology"] will be created
  + resource "github_team_repository" "team_repo" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "pull"
      + repository = "ols_svc_genai2"
      + team_id    = "technology"
    }

  # module.workload_identity.google_project_iam_member.sa_iam will be created
  + resource "google_project_iam_member" "sa_iam" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "ols-platform-dev"
      + role    = "roles/cloudkms.cryptoKeyEncrypterDecrypter"
    }

  # module.workload_identity.google_service_account.gsa will be created
  + resource "google_service_account" "gsa" {
      + account_id   = "ols-svc-genai2"
      + disabled     = false
      + display_name = "Service Account for ols-svc-genai2 service"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "ols-platform-dev"
      + unique_id    = (known after apply)
    }

  # module.workload_identity.google_service_account_iam_binding.workload_identity_binding will be created
  + resource "google_service_account_iam_binding" "workload_identity_binding" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + members            = [
          + "serviceAccount:ols-platform-dev.svc.id.goog[dev/ols-svc-genai2]",
        ]
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = (known after apply)
    }

Plan: 12 to add, 0 to change, 0 to destroy.
╷
│ Error: Invalid function argument
│ 
│   on ../../../modules/cicd/helm/helm.tf line 78, in resource "helm_release" "helm":
│   77:     "${templatefile(
│   78:       "${replace(local.feature, "-", "_")}/values.yaml",
│   79:       {
│   80:         service_account_name       = var.service_account_name
│   81:         unit                       = split("-", var.service_account_name)[0]
│   82:         code                       = split("-", var.service_account_name)[2]
│   83:         env                        = var.env
│   84:         feature                    = local.feature
│   85:         dns_name                   = var.dns_name
│   86:         service_account_annotation = var.create_service_account ? google_service_account.gsa[0].email : null
│   87:         extra_vars          = var.extra_vars
│   88:       }
│   89:       )
│     ├────────────────
│     │ while calling templatefile(path, vars)
│     │ local.feature is "genai2"
│ 
│ Invalid value for "path" parameter: no file exists at "genai2/values.yaml";
│ this function works only with files that are distributed as part of the
│ configuration source code, so if this file will be created by a resource in
│ this configuration you must instead obtain this result from an attribute of
│ that resource.
╵


```
</details>